tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/0.orig/T
/* OpenFOAM v2512 — C9 2D fine mesh (Liu 2020) */
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15;
boundaryField
{
    inlet { type fixedValue; value uniform 293.15; }
    gateOutlet { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    atmosphere { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    walls { type zeroGradient; }
    riserWall { type zeroGradient; }
    gateWall { type zeroGradient; }
    frontAndBack { type empty; }
}
