tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/0.orig/k
/* OpenFOAM v2512 — C9 2D fine mesh (Liu 2020) */
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.0023747152;
boundaryField
{
    inlet { type fixedValue; value uniform 0.0023747152; }
    gateOutlet { type inletOutlet; inletValue uniform 0.0023747152; value uniform 0.0023747152; }
    atmosphere { type inletOutlet; inletValue uniform 0.0023747152; value uniform 0.0023747152; }
    walls { type kqRWallFunction; value uniform 0.0023747152; }
    riserWall { type kqRWallFunction; value uniform 0.0023747152; }
    gateWall { type kqRWallFunction; value uniform 0.0023747152; }
    frontAndBack { type empty; }
}
