tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/0.orig/p
/* OpenFOAM v2512 — C9 2D fine mesh (Liu 2020) */
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 108669.256500;
boundaryField
{
    inlet { type calculated; value uniform 108669.256500; }
    gateOutlet { type calculated; value uniform 104066.855760; }
    atmosphere { type calculated; value uniform 101325.000000; }
    walls { type calculated; value uniform 108669.256500; }
    riserWall { type calculated; value uniform 108669.256500; }
    gateWall { type calculated; value uniform 108669.256500; }
    frontAndBack { type empty; }
}
