tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/Allrun.mesh
#!/bin/bash
cd "$(dirname "$0")"
source /usr/lib/openfoam/openfoam2512/etc/bashrc
set -euo pipefail
blockMesh > log.blockMesh 2>&1
checkMesh > log.checkMesh 2>&1
echo MESH_DONE
