tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/constant/g
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 0 -9.81);
