tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/constant/thermophysicalProperties
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

phases (water air);
pMin 50000;
sigma
{
    type constant;
    sigma 0.072;
}
