tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/constant/thermophysicalProperties.air
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectGas;
    specie specie;
    energy sensibleInternalEnergy;
}
mixture
{
    specie { molWeight 28.965; }
    thermodynamics { Cp 1005.0; Hf 0; }
    transport { mu 1.81e-05; Pr 0.71; }
}
