tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/constant/thermophysicalProperties.water
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectFluid;
    specie specie;
    energy sensibleInternalEnergy;
}
mixture
{
    specie { molWeight 18.01528; }
    equationOfState
    {
        R 317.3290125;
        rho0 997.1107767;
    }
    thermodynamics { Cp 4182; Hf 0; }
    transport { mu 0.001003; Pr 7.0; }
}
