tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/system/blockMeshDict
/* OpenFOAM v2512 — C9 2D fine mesh (Liu 2020) */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-5.8 -0.005 0.18)
    (-5.8 0.005 0.18)
    (0 -0.005 0.18)
    (0 0.005 0.18)
    (0 -0.005 0.28)
    (0 0.005 0.28)
    (-5.8 -0.005 0.28)
    (-5.8 0.005 0.28)
    (0 -0.005 0.38)
    (0 0.005 0.38)
    (-5.8 -0.005 0.38)
    (-5.8 0.005 0.38)
    (0 -0.005 0)
    (0 0.005 0)
    (0.12 -0.005 0)
    (0.12 0.005 0)
    (0.12 -0.005 0.03742414805)
    (0.12 0.005 0.03742414805)
    (0 -0.005 0.03742414805)
    (0 0.005 0.03742414805)
    (0.12 -0.005 0.18)
    (0.12 0.005 0.18)
    (0.12 -0.005 0.28)
    (0.12 0.005 0.28)
    (0.12 -0.005 0.38)
    (0.12 0.005 0.38)
    (0.12 -0.005 0.45)
    (0.12 0.005 0.45)
    (0 -0.005 0.45)
    (0 0.005 0.45)
    (0.18 -0.005 0)
    (0.18 0.005 0)
    (0.18 -0.005 0.03742414805)
    (0.18 0.005 0.03742414805)
    (0.18 -0.005 0.18)
    (0.18 0.005 0.18)
    (0.18 -0.005 0.28)
    (0.18 0.005 0.28)
    (0.18 -0.005 0.38)
    (0.18 0.005 0.38)
    (0.18 -0.005 0.45)
    (0.18 0.005 0.45)
    (0.3 -0.005 0)
    (0.3 0.005 0)
    (0.3 -0.005 0.03742414805)
    (0.3 0.005 0.03742414805)
    (0.3 -0.005 0.18)
    (0.3 0.005 0.18)
    (0.3 -0.005 0.28)
    (0.3 0.005 0.28)
    (0.3 -0.005 0.38)
    (0.3 0.005 0.38)
    (0.3 -0.005 0.45)
    (0.3 0.005 0.45)
    (6.25 -0.005 0)
    (6.25 0.005 0)
    (6.25 -0.005 0.03742414805)
    (6.25 0.005 0.03742414805)
    (6.25 -0.005 0.18)
    (6.25 0.005 0.18)
    (6.25 -0.005 0.28)
    (6.25 0.005 0.28)
    (0.18 -0.005 1.67)
    (0.18 0.005 1.67)
    (0.12 -0.005 1.67)
    (0.12 0.005 1.67)
    (-0.15 -0.005 1.67)
    (-0.15 0.005 1.67)
    (0.12 -0.005 2.67)
    (0.12 0.005 2.67)
    (-0.15 -0.005 2.67)
    (-0.15 0.005 2.67)
    (0.18 -0.005 2.67)
    (0.18 0.005 2.67)
    (0.45 -0.005 1.67)
    (0.45 0.005 1.67)
    (0.45 -0.005 2.67)
    (0.45 0.005 2.67)
);

blocks
(
    hex (0 6 4 2 1 7 5 3) (25 1450 1) simpleGrading (1 1 1)
    hex (6 10 8 4 7 11 9 5) (25 1450 1) simpleGrading (1 1 1)
    hex (12 18 16 14 13 19 17 15) (12 36 1) simpleGrading (1 1 1)
    hex (18 2 20 16 19 3 21 17) (32 36 1) simpleGrading (1 1 1)
    hex (2 4 22 20 3 5 23 21) (25 36 1) simpleGrading (1 1 1)
    hex (4 8 24 22 5 9 25 23) (25 36 1) simpleGrading (1 1 1)
    hex (8 28 26 24 9 29 27 25) (28 36 1) simpleGrading (1 1 1)
    hex (14 16 32 30 15 17 33 31) (12 24 1) simpleGrading (1 1 1)
    hex (16 20 34 32 17 21 35 33) (32 24 1) simpleGrading (1 1 1)
    hex (20 22 36 34 21 23 37 35) (25 24 1) simpleGrading (1 1 1)
    hex (22 24 38 36 23 25 39 37) (25 24 1) simpleGrading (1 1 1)
    hex (24 26 40 38 25 27 41 39) (28 24 1) simpleGrading (1 1 1)
    hex (30 32 44 42 31 33 45 43) (12 36 1) simpleGrading (1 1 1)
    hex (32 34 46 44 33 35 47 45) (32 36 1) simpleGrading (1 1 1)
    hex (34 36 48 46 35 37 49 47) (25 36 1) simpleGrading (1 1 1)
    hex (36 38 50 48 37 39 51 49) (25 36 1) simpleGrading (1 1 1)
    hex (38 40 52 50 39 41 53 51) (28 36 1) simpleGrading (1 1 1)
    hex (42 44 56 54 43 45 57 55) (12 1488 1) simpleGrading (1 1 1)
    hex (44 46 58 56 45 47 59 57) (32 1488 1) simpleGrading (1 1 1)
    hex (46 48 60 58 47 49 61 59) (25 1488 1) simpleGrading (1 1 1)
    hex (26 64 62 40 27 65 63 41) (305 24 1) simpleGrading (1 1 1)
    hex (66 70 68 64 67 71 69 65) (200 45 1) simpleGrading (1 1 1)
    hex (64 68 72 62 65 69 73 63) (200 24 1) simpleGrading (1 1 1)
    hex (62 72 76 74 63 73 77 75) (200 45 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 7 1)
            (6 10 11 7)
        );
    }
    gateOutlet
    {
        type patch;
        faces
        (
            (54 56 57 55)
        );
    }
    gateWall
    {
        type wall;
        faces
        (
            (56 58 59 57)
            (58 60 61 59)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (70 68 69 71)
            (68 72 73 69)
            (72 76 77 73)
            (66 70 71 67)
            (74 75 77 76)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 2 3 1)
            (10 11 9 8)
            (12 14 15 13)
            (14 30 31 15)
            (30 42 43 31)
            (42 54 55 43)
            (48 49 61 60)
            (12 13 19 18)
            (18 19 3 2)
            (8 9 29 28)
            (28 29 27 26)
            (40 41 53 52)
            (48 50 51 49)
            (50 52 53 51)
        );
    }
    riserWall
    {
        type wall;
        faces
        (
            (26 27 65 64)
            (40 62 63 41)
            (66 64 65 67)
            (62 74 75 63)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 6 4 2)
            (1 3 5 7)
            (6 10 8 4)
            (7 5 9 11)
            (12 18 16 14)
            (13 15 17 19)
            (18 2 20 16)
            (19 17 21 3)
            (2 4 22 20)
            (3 21 23 5)
            (4 8 24 22)
            (5 23 25 9)
            (8 28 26 24)
            (9 25 27 29)
            (14 16 32 30)
            (15 31 33 17)
            (16 20 34 32)
            (17 33 35 21)
            (20 22 36 34)
            (21 35 37 23)
            (22 24 38 36)
            (23 37 39 25)
            (24 26 40 38)
            (25 39 41 27)
            (30 32 44 42)
            (31 43 45 33)
            (32 34 46 44)
            (33 45 47 35)
            (34 36 48 46)
            (35 47 49 37)
            (36 38 50 48)
            (37 49 51 39)
            (38 40 52 50)
            (39 51 53 41)
            (42 44 56 54)
            (43 55 57 45)
            (44 46 58 56)
            (45 57 59 47)
            (46 48 60 58)
            (47 59 61 49)
            (26 64 62 40)
            (27 41 63 65)
            (66 70 68 64)
            (67 65 69 71)
            (64 68 72 62)
            (65 63 73 69)
            (62 72 76 74)
            (63 75 77 73)
        );
    }
);

mergePatchPairs
(
);
