tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/system/decomposeParDict
/* OpenFOAM v2512 — C9 2D fine mesh (Liu 2020) */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;
method          scotch;
