tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/system/fvSchemes
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes { default Euler; }
gradSchemes { default Gauss linear; }
divSchemes
{
    div(phi,alpha) Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(phi,thermo:rho.water) Gauss upwind;
    div(phi,thermo:rho.air) Gauss upwind;
    div(rhoPhi,U) Gauss upwind;
    div(rhoPhi,T) Gauss upwind;
    div(rhoPhi,K) Gauss upwind;
    div(phi,p) Gauss upwind;
    div(rhoPhi,k) Gauss upwind;
    div(rhoPhi,omega) Gauss upwind;
    div(phi,pocketBodyTracer) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
    default Gauss linear corrected;
    laplacian(pocketBodyTracerCarrierPotential) Gauss linear corrected;
}
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
