tests/test_03_liu2020/cases/C9_Q25to40_hr03_airpocket/openfoam/2d/case/system/fvSolution
/* OpenFOAM v2512 source generated by prepare_case.py */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr 1;
        nAlphaSubCycles 2;
        cAlpha 1;
        MULESCorr no;
        nLimiterIter 5;
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0;
    }
    "pcorr.*"
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-5;
            relTol 0;
            smoother DICGaussSeidel;
        }
        tolerance 1e-5;
        relTol 0;
        maxIter 100;
    }
    ".*(rho|rhoFinal)" { solver diagonal; }
    p_rgh
    {
        solver GAMG;
        tolerance 1e-7;
        relTol 0.01;
        smoother DIC;
    }
    p_rghFinal
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-7;
            relTol 0;
            nVcycles 2;
            smoother DICGaussSeidel;
            nPreSweeps 2;
        }
        tolerance 1e-7;
        relTol 0;
        maxIter 50;
    }
    pocketBodyTracerCarrierPotential
    {
        solver GAMG;
        tolerance 1e-8;
        relTol 0;
        smoother DIC;
    }
    pocketBodyTracer
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-10;
        relTol 0;
        maxIter 200;
        nLimiterIter 5;
    }
    pocketBodyTracerSigma
    {
        nLimiterIter 10;
    }
    "U.*"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0.01;
        nSweeps 1;
    }
    "(T|k|omega|pocketBodyTracer|B|nuTilda).*"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0.01;
        maxIter 100;
    }
}
PIMPLE
{
    momentumPredictor yes;
    transonic no;
    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
}
